app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'bevolop150@gamepec.com'
AND `role` = 'ITSO'
 LIMIT 1
UPDATE `users` SET `password_hash` = '$2y$10$doSXVwK287HtRsvTlJzXc.9hNq6jlQ/YHZC..5rPcfGPjCJCHOtwK', `updated_at` = '2025-11-23 15:26:39'
WHERE `users`.`user_id` IN ('5')
---
    public function update_password()
    {
        $session = session();
        $validation = service('validation');

        $email = $this->request->getPost('email');

        $data = [
            'new_password' => $this->request->getPost('new_password'),
            'confirm_password' => $this->request->getPost('confirm_password')
        ];

        if (!$validation->run($data, 'password_reset')) {
            $session->setFlashdata('errors', $validation->getErrors());
            return redirect()->to(base_url('auth/reset_password_form?email=' . urlencode($email)))->withInput();
        }

        $usersModel = model('Users_model');
        $user = $usersModel->where('email', $email)->where('role', 'ITSO')->first();

        if (!$user) {
            $session->setFlashdata('errors', ['Invalid reset link.']);
            return redirect()->to(base_url('auth/reset'));
        }

        $hashedPassword = password_hash($data['new_password'], PASSWORD_DEFAULT);
        $usersModel->update($user['user_id'], ['password_hash' => $hashedPassword]);