app/Controllers/Borrowing.php

SELECT *
FROM `reservations`
WHERE `reserved_date` = '2025-11-25'
AND `status` = 'Active'
AND `reservation_confirmation` = 1
---
    public function index()
    {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $borrowingmodel = model('BorrowRecords_Model');
        $reservationmodel = model('Reservations_Model');
        $equipmentmodel = model('Equipment_model');

        // Check all reservations and convert to borrow if reserved_date is today
        $currentDate = date('Y-m-d');
        $reservations = $reservationmodel->where('reserved_date', $currentDate)
                                         ->where('status', 'Active')
                                         ->where('reservation_confirmation', 1)
                                         ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `borrow_records`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
WHERE borrow_records.returned_at IS NULL
AND `borrow_records`.`status` = 'Borrowed'
SELECT `borrow_records`.*, `users`.`last_name` as `user_name`, `equipment`.`name` as `equipment_name`, `equipment`.`accessories` as `accessories`
FROM `borrow_records`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
WHERE borrow_records.returned_at IS NULL
AND `borrow_records`.`status` = 'Borrowed'
 LIMIT 10
---
        }

        $data = ['title' => 'Borrowing',
                'borrowing' => $borrowingmodel
                    ->select('borrow_records.*, users.last_name as user_name, equipment.name as equipment_name, equipment.accessories as accessories')
                    ->join('users', 'users.user_id = borrow_records.user_id')
                    ->join('equipment', 'equipment.equipment_id = borrow_records.equipment_id')
                    ->where('borrow_records.returned_at IS NULL', null, false)
                    ->where('borrow_records.status', 'Borrowed')
                    ->paginate(10),