app/Controllers/Equipment.php

    public function index()
    {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $equipmentModel = model('Equipment_model');
        $equipment = $equipmentModel->findAll();
---
SELECT *
FROM `equipment`