app/Controllers/Index.php

    public function index() {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $session = session();
        $usermodel = model('Users_Model');
        $equipmentmodel = model('Equipment_Model');
        $borrowmodel = model('BorrowRecords_Model');
        $reservationmodel = model('Reservations_Model');

        $data = array(
            'title' => 'ITSO - DASHBOARD',
            'totalUsers' => $usermodel->countAllResults(),
            'totalEquipment' => $equipmentmodel->countAllResults(),
            'totalBorrowed' => $borrowmodel->where('returned_at IS NULL', null, false)->where('status', 'Borrowed')->countAllResults(false),
            'totalReservations' => $reservationmodel->where('reservation_confirmation', '1')->where('status', 'Active')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `reservation_confirmation` = '1'
AND `status` = 'Active'