app/Controllers/Index.php

SELECT `borrow_records`.*, `users`.`last_name` as `user_name`, `equipment`.`name` as `equipment_name`, `equipment`.`accessories` as `accessories`
FROM `borrow_records`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
WHERE returned_at IS NULL
AND `status` = 'Borrowed'
AND borrow_records.returned_at IS NULL
AND `borrow_records`.`status` = 'Borrowed'
ORDER BY `borrow_records`.`borrowed_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `equipment`
SELECT `borrow_records`.*, `users`.`last_name` as `user_name`, `equipment`.`name` as `equipment_name`, `equipment`.`accessories` as `accessories`
FROM `borrow_records`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
WHERE returned_at IS NULL
AND borrow_records.returned_at IS NULL
ORDER BY `borrow_records`.`borrowed_at` DESC
 LIMIT 5
---
    public function index() {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $session = session();
        $usermodel = model('Users_Model');
        $equipmentmodel = model('Equipment_Model');
        $borrowmodel = model('BorrowRecords_Model');
        $reservationmodel = model('Reservations_Model');

        $data = array(
            'title' => 'ITSO - DASHBOARD',
            'totalUsers' => $usermodel->countAllResults(),
            'totalEquipment' => $equipmentmodel->countAllResults(),
            'totalBorrowed' => $borrowmodel->where('returned_at IS NULL', null, false)->countAllResults(false),
            'totalReservations' => $reservationmodel->where('status', 'Active')->countAllResults(),
            'borrowing' => $borrowmodel
                    ->select('borrow_records.*, users.last_name as user_name, equipment.name as equipment_name, equipment.accessories as accessories')
                    ->join('users', 'users.user_id = borrow_records.user_id')
                    ->join('equipment', 'equipment.equipment_id = borrow_records.equipment_id')
                    ->where('borrow_records.returned_at IS NULL', null, false)
                    ->orderBy('borrow_records.borrowed_at', 'DESC')
                    ->limit(5)
                    ->findAll()
        );