app/Controllers/Reports.php

    public function userHistory()
    {
    $check = $this->auth();
    if ($check !== null) {
        return $check;
    }
    $usermodel = model('Users_model');
    $borrowingmodel = model('BorrowRecords_Model');
    $equipmentmodel = model('Equipment_model');

    $data = ['title' => 'Borrowed User History Report',
            'borrowing' => $borrowingmodel
                ->select('borrow_records.*, users.last_name as user_name, equipment.name as equipment_name, equipment.accessories as accessories')
                ->join('users', 'users.user_id = borrow_records.user_id')
                ->join('equipment', 'equipment.equipment_id = borrow_records.equipment_id')
                ->where('borrow_records.returned_at IS NOT NULL', null, false)
                ->where('borrow_records.status', 'Returned')
                ->paginate(10),
---
SELECT COUNT(*) AS `numrows`
FROM `borrow_records`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
WHERE borrow_records.returned_at IS NULL
AND `borrow_records`.`status` = 'Borrowed'
SELECT `borrow_records`.*, `users`.`last_name` as `user_name`, `equipment`.`name` as `equipment_name`, `equipment`.`accessories` as `accessories`
FROM `borrow_records`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
WHERE borrow_records.returned_at IS NULL
AND `borrow_records`.`status` = 'Borrowed'
 LIMIT 10