app/Controllers/Reservations.php

    public function index()
    {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $reservationmodel = model('Reservations_model');

        $data = ['title' => 'Reservations',
                'reservations' => $reservationmodel
                    ->select('reservations.*, users.last_name as user_name, equipment.name as equipment_name')
                    ->join('users', 'users.user_id = reservations.user_id')
                    ->join('equipment', 'equipment.equipment_id = reservations.equipment_id')
                    ->where('reservations.status', 'Active')
                    ->paginate(10),
---
SELECT COUNT(*) AS `numrows`
FROM `reservations`
JOIN `users` ON `users`.`user_id` = `reservations`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `reservations`.`equipment_id`
WHERE `reservations`.`status` = 'Active'
SELECT `reservations`.*, `users`.`last_name` as `user_name`, `equipment`.`name` as `equipment_name`
FROM `reservations`
JOIN `users` ON `users`.`user_id` = `reservations`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `reservations`.`equipment_id`
WHERE `reservations`.`status` = 'Active'
 LIMIT 10

    public function insert()
    {

        $reservationsmodel = model('Reservations_model');
        $usersmodel = model('Users_model');
        $equipmentmodel = model('Equipment_model');
        $session = session();
        $validation = service('validation');

        $data = array(
            'email' => strtolower(trim($this->request->getPost('email'))),
            'equipment_id' => $this->request->getPost('equipment_id'),
            'quantity' => $this->request->getPost('quantity'),
            'reserved_date' => $this->request->getPost('reserved_date'),
            'status' => 'Active'
        );
        // using validation rules
        if(!$validation->run($data, 'reservation')){
            $session->setFlashdata('errors', $validation->getErrors());
            return redirect()->to(base_url('reservations/reserve'))->withInput();
        }
        // to check if email belongs to an active Associate
        $user = $usersmodel->where('email', $data['email'])->where('role', 'Associate')->first();
---
SELECT *
FROM `users`
WHERE `email` = 'temiw80539@bipochub.com'
AND `role` = 'Associate'
 LIMIT 1