app/Controllers/Reservations.php

SELECT COUNT(*) AS `numrows`
FROM `reservations`
JOIN `users` ON `users`.`user_id` = `reservations`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `reservations`.`equipment_id`
WHERE `reservations`.`status` = 'Active'
AND `reservations`.`reservation_confirmation` = 1
SELECT `reservations`.*, `users`.`last_name` as `user_name`, `equipment`.`name` as `equipment_name`, `equipment`.`accessories`
FROM `reservations`
JOIN `users` ON `users`.`user_id` = `reservations`.`user_id`
JOIN `equipment` ON `equipment`.`equipment_id` = `reservations`.`equipment_id`
WHERE `reservations`.`status` = 'Active'
AND `reservations`.`reservation_confirmation` = 1
 LIMIT 10
---
    public function index()
    {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $reservationmodel = model('Reservations_model');

        $data = ['title' => 'Reservations',
                'reservations' => $reservationmodel
                    ->select('reservations.*, users.last_name as user_name, equipment.name as equipment_name, equipment.accessories')
                    ->join('users', 'users.user_id = reservations.user_id')
                    ->join('equipment', 'equipment.equipment_id = reservations.equipment_id')
                    ->where('reservations.status', 'Active')
                    ->where('reservations.reservation_confirmation', 1)
                    ->paginate(10),

SELECT *
FROM `users`
WHERE `email` = 'hefap91108@izeao.com'
 LIMIT 1
---

    // Prepare data for insertion - replace email with user_id
    $userEmail = $data['email'];
    $user = $usersmodel->where('email', $userEmail)->first();

SELECT *
FROM `equipment`
WHERE `equipment`.`equipment_id` = '1'
---
    $data['user_id'] = $user['user_id'];
    unset($data['email']);

    $equipment = $equipmentmodel->find($data['equipment_id']);

INSERT INTO `reservations` (`equipment_id`, `quantity`, `reserved_date`, `status`, `reservation_token`, `user_id`, `created_at`, `updated_at`) VALUES ('1', '1', '2025-11-25', 'Active', '9d6cb374fd5684a986813dd90f5c1d9b', '21', '2025-11-24 12:55:11', '2025-11-24 12:55:11')
---
    }
    // REMOVED: Equipment count reduction - will be done in confirm()

    $reservationsmodel->insert($data);

SELECT *
FROM `reservations`
WHERE `reservation_token` = '9d6cb374fd5684a986813dd90f5c1d9b'
 LIMIT 1
SELECT *
FROM `equipment`
WHERE `equipment`.`equipment_id` = '1'
UPDATE `equipment` SET `available_count` = 9, `updated_at` = '2025-11-24 12:55:30'
WHERE `equipment`.`equipment_id` IN ('1')
---
    public function confirm($reservation_token)
    {
    $reservationsmodel = model('Reservations_model');
    $borrowmodel = model('BorrowRecords_Model');
    $equipmentmodel = model('Equipment_model');
    $session = session();

    $reservation = $reservationsmodel->where('reservation_token', $reservation_token)->first();

    if($reservation){
        // Check if already confirmed
        if($reservation['reservation_confirmation'] == 1){
            $session->setFlashdata('msg', 'Reservation already confirmed.');
            return redirect()->to(base_url('reservations/confirmationView'));
        }

        // Get equipment details
        $equipment = $equipmentmodel->find($reservation['equipment_id']);

        // Check if enough equipment available
        if (!$equipment || $equipment['available_count'] < $reservation['quantity']) {
            $session->setFlashdata('errors', ['quantity' => "Not enough equipment available. Only {$equipment['available_count']} left in stock."]);
            return redirect()->to(base_url('reservations/confirmationView'));
        }

        // Reduce equipment count
        $equipmentmodel->update($reservation['equipment_id'], [
            'available_count' => $equipment['available_count'] - $reservation['quantity']
        ]);

UPDATE `reservations` SET `reservation_confirmation` = 1, `updated_at` = '2025-11-24 12:55:30'
WHERE `reservations`.`reservation_id` IN ('30')
---
        $data_update = array(
            'reservation_confirmation' => 1,
        );
        $reservationsmodel->update($reservation['reservation_id'], $data_update);