app/Controllers/Returns.php

    public function index()
    {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $borrowingmodel = model('BorrowRecords_Model');
        $equipmentmodel = model('Equipment_model');
        $usermodel = model('User_model');
        $session = session();

        // Get returned items with equipment and user details
        $data = ['title' => 'Returns',
                 'returnedItems' => $borrowingmodel
                    ->select('borrow_records.*, equipment.name, equipment.accessories as accessories, users.first_name as first_name, users.last_name as last_name')
                    ->join('equipment', 'equipment.equipment_id = borrow_records.equipment_id')
                    ->join('users', 'users.user_id = borrow_records.user_id')
                    ->where('borrow_records.status', 'Returned')
                    ->orderBy('borrow_records.returned_at', 'DESC')
                    ->paginate(10),
---
SELECT COUNT(*) AS `numrows`
FROM `borrow_records`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
WHERE `borrow_records`.`status` = 'Returned'
SELECT `borrow_records`.*, `equipment`.`name`, `equipment`.`accessories` as `accessories`, `users`.`first_name` as `first_name`, `users`.`last_name` as `last_name`
FROM `borrow_records`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_records`.`equipment_id`
JOIN `users` ON `users`.`user_id` = `borrow_records`.`user_id`
WHERE `borrow_records`.`status` = 'Returned'
ORDER BY `borrow_records`.`returned_at` DESC
 LIMIT 10