app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `email_verified` = 1
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email_verified` = 1
---
    public function index() {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }

        // load model and fetch users
        $usermodel = model('Users_model');

        $data = array (
            'title' => 'Users List',
            'users' => $usermodel->where('email_verified', 1)->paginate(10),
            'pager' => $usermodel->pager
        );

SELECT *
FROM `users`
WHERE `token` = '877f4c20c390d9a6a8f65a99b4164646'
 LIMIT 1
UPDATE `users` SET `email_verified` = 1, `updated_at` = '2025-11-24 12:54:23'
WHERE `users`.`user_id` IN ('21')
---
    public function verify($token){
        $usermodel = model('Users_model');
        $session = session();

        $user = $usermodel->where('token', $token)->first();
        if($user){
            $data_update = array(
                'email_verified' => 1,
            );
            $usermodel->update($user['user_id'], $data_update);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '1'
---
    public function view($user_id = null)
    {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $usermodel = model('Users_model');
        $data = array (
                'title' => 'View User',
                'user'=>$usermodel->find($user_id)
            );

SELECT *
FROM `users`
WHERE `users`.`user_id` = '4'
UPDATE `users` SET `is_active` = 0, `updated_at` = '2025-11-24 12:33:59'
WHERE `users`.`user_id` IN ('4')
---
    public function confirmDeactivate($id = null)
    {
        $check = $this->auth();
        if ($check !== null) {
            return $check;
        }
        $usermodel = model('Users_model');
        $session = session();

        $user = $usermodel->find($id);

        $data_update = array(
            'is_active' => 0
        );

        $usermodel->update($id, $data_update);